frontend/controllers/SiteController.php

SELECT `id`, `name`, `description`, `price`, `category`, `city`, `zipcode`, `street`, `avatar` FROM `location` WHERE `type`=0
---
    public function actionIndex()
    {
      $paid = Yii::$app->manage->createCommand("SELECT * from `time_gz_time_slot_users`")->queryAll();
      $sport = Yii::$app->manage->createCommand("SELECT * from `time_gz_time_slot_type`")->queryAll();


      $mailing = new Mailing();
      $searchModel = new LocationSearch();

      $public = (new Query())
        ->select(['id', 'name', 'description', 'price', 'category', 'city', 'zipcode', 'street', 'avatar'])
        ->from('location')
        ->where(['type' => 0])
        ->all();

      if ($mailing->load(Yii::$app->request->post()) && $mailing->save()) {