frontend/views/location/_globalsearch.php

SELECT * FROM `category`
SELECT * FROM `location`
---
<div class="row">


		<?= $form->field($model, 'category_id', ['showLabels'=>false])->widget(Select2::classname(), [
		    'data'=> ArrayHelper::map(Category::find()->all(), 'id', 'name'),
		    'pluginOptions'=> ['
		    	allowClear'=>true,
		    	'width' => '200px',
		    ],
		    'options' => ['placeholder'=>'Kies een sport'],
		    'size' => Select2::LARGE
		]); ?>


		<?= $form->field($model, 'city', ['showLabels'=>false])->widget(Select2::classname(), [
		    'data'=> ArrayHelper::map(Location::find()->all(), 'city', 'city'),
		    'pluginOptions'=> ['
		    	allowClear'=>true,
		    	'width' => '200px',
		    ],
		    'options' => ['placeholder'=>'Kies een stad'],
		    'size' => Select2::LARGE
		]); ?>