frontend/views/location/_search.php


<div class="row">

		<?= $form->field($model, 'category_id', ['showLabels'=>false])->widget(Select2::classname(), [
		    'data'=> ArrayHelper::map(Category::find()->all(), 'id', 'name'),
		    'pluginOptions'=>['
		    	allowClear'=>true,
		    	'width' => '180px',
		    ],

		    'options' => ['placeholder'=>'Selecteer een sport'],
		    'size' => Select2::SMALL
		]); ?>

		<?= $form->field($model, 'city', ['showLabels'=>false])->widget(Select2::classname(), [
		    'data'=> ArrayHelper::map(Location::find()->all(), 'city', 'city'),
		    'pluginOptions'=>['
		    	allowClear'=>true,
		    	'width' => '180px',
		    ],
		    'options' => ['placeholder'=>'Zoek op locatie'],
		    'size' => Select2::SMALL
		]); ?>

		<?= $form->field($userModel, 'city', ['showLabels'=>false])->widget(Select2::classname(), [
		    'data'=> [ArrayHelper::map(User::find()->all(), 'city', 'city')],
		    'pluginOptions'=>['
		    	allowClear'=>true,
		    	'width' => '180px',
		    ],
		    'options' => ['placeholder'=>'Zoek een Sportbuddy'],
		    'size' => Select2::SMALL
		]); ?>
---
SELECT * FROM `category`
SELECT * FROM `location`
SELECT * FROM `user`